Table of Contents
 Class FeaBimLink
Namespace
IdeaStatiCa.BimApiLink
Assembly
IdeaStatiCa.BimApiLink.dll
public class FeaBimLink : BimLink
Inheritance
object
BimLink
FeaBimLink
Inherited Members
 BimLink.ApplicationName
 BimLink.WithIdeaStatiCa(string)
 BimLink.WithLogger(IPluginLogger)
 BimLink.WithImporters(Action<ImportersConfiguration>)
 BimLink.WithResultsImporters(Action<ResultsImportersConfiguration>)
 BimLink.WithBimImporterConfiguration(BimImporterConfiguration)
 BimLink.WithImporterHook(IImporterHook)
 BimLink.WithPluginHook(IPluginHook)
 BimLink.WithScopeHook(IScopeHook)
 BimLink.WithUserDataSource(IBimUserDataSource)
 BimLink.WithTaskScheduler(TaskScheduler)
 BimLink.InitHostingClient(IPluginLogger)
 BimLink.Run(IModel)
 BimLink.CreateApplicationBIM(IModel, IPluginLogger, IProgressMessaging)
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 FeaBimLink(string, string)
public FeaBimLink(string applicationName, string projectPath)
Parameters
applicationName string
projectPath string
Methods
 Create(IPluginLogger, IBimApiImporter, string, BimImporterConfiguration, IProgressMessaging, IBimResultsProvider, IPluginHook, IScopeHook, IModel, IBimUserDataSource, TaskScheduler)
protected override IApplicationBIM Create(IPluginLogger logger, IBimApiImporter bimApiImporter, string projectPath, BimImporterConfiguration bimImporterConfiguration, IProgressMessaging remoteApp, IBimResultsProvider resultsProvider, IPluginHook pluginHook, IScopeHook scopeHook, IModel model, IBimUserDataSource userDataSource, TaskScheduler taskScheduler)
Parameters
logger IPluginLogger
bimApiImporter IBimApiImporter
projectPath string
bimImporterConfiguration BimImporterConfiguration
remoteApp IProgressMessaging
resultsProvider IBimResultsProvider
pluginHook IPluginHook
scopeHook IScopeHook
model IModel
userDataSource IBimUserDataSource
taskScheduler TaskScheduler
Returns
IApplicationBIM
 Create(string, string)
public static BimLink Create(string applicationName, string checkbotProjectPath)
Parameters
applicationName string
checkbotProjectPath string
Returns
BimLink
 Edit this page